---
type: Segment
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# Segment

`Autodesk.Revit.DB.Segment` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddSize | 2013 | `public void AddSize ( MEPSize size )` |
| Method | GetSizes | 2013 | `public ICollection < MEPSize > GetSizes ()` |
| Method | RemoveSize | 2013 | `public void RemoveSize ( double nominalDiameter )` |
| Property | Description | 2013 | `public string Description { get ; set ; }` |
| Property | MaterialId | 2013 | `public ElementId MaterialId { get ; }` |
| Property | Parameter | — | `` |
| Property | Roughness | 2013 | `public double Roughness { get ; set ; }` |
| Property | SizeCount | 2013 | `public int SizeCount { get ; }` |